// Project imports:
import 'package:zhks/features/chats/data/models/news_message.dart';

final List<NewsMessage> mockNewsMessages = [
  NewsMessage(
    id: 1,
    message: '🚧 Завтра отключение воды с 10:00 до 14:00.',
    createdAt: '2024-08-20 09:00:00',
  ),
  NewsMessage(
    id: 2,
    message: '📢 Общее собрание жильцов состоится 25 августа.',
    createdAt: '2024-08-21 14:30:00',
  ),
  NewsMessage(
    id: 3,
    message: '📄 Добавлен новый отчёт о проделанных работах за июль.',
    createdAt: '2024-08-22 08:45:00',
  ),
  NewsMessage(
    id: 4,
    message: '🧹 В эту субботу — субботник! Приходите помочь!',
    createdAt: '2024-08-23 11:00:00',
  ),
  NewsMessage(
    id: 5,
    message: '🏗 Начались ремонтные работы в подъезде №2.',
    createdAt: '2024-08-24 13:20:00',
  ),
  NewsMessage(
    id: 6,
    message: '📦 Установлен новый ящик для доставки.',
    createdAt: '2024-08-25 10:15:00',
  ),
];
